[{"id":"PO_1.1","text":"How can the success of the project be evaluated? (choose 2 answers) *","options":["Improved KPIs through frequent releases","Increased customer satisfaction","Delivering an increment every Sprint","Lower production cost","Increased velocity"],"answers":[0,1],"desiredAnswers":null},{"id":"PO_1.2","text":"The Product Owner ensures enough items are selected from the Product Backlog in the Sprint Planning meeting in order to satisfy the stakeholders. *","options":["FALSE","TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_1.3","text":"A first Sprint can start before the Product Owner has a complete and exhaustive Product Backlog in place. *","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_1.4","text":"How should a Product Backlog item be refined when it is located at the top? (choose 2 answers) *","options":["It should be clear which developer is responsible for it.","In a way that it can be “Done” in the timeboxed duration of one Sprint","In a way that it’s clear enough for the developers.","All the tasks required for completing it should be identified."],"answers":[1,2],"desiredAnswers":null},{"id":"PO_1.5","text":"Choose 3 activities which may be the responsibilities of the Product Owner. *","options":["Break down Product Backlog Items into smaller ones","Create Product Backlog Items","Prioritize the backlog","Design Software","Facilitate meetings","Provide estimates","Make technical decisions"],"answers":[0,1,2],"desiredAnswers":null},{"id":"PO_1.6","text":"The Product Owner does not have to be one person, and the role can be played by a committee. *","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_1.7","text":"Which statements are correct about a Sprint Backlog item that was not finished until the end of the Sprint? (choose 2 answers) *","options":["It won’t be demonstrated at the Sprint Review meeting","It will be completed in the next Sprint","It will be moved back to the Product Backlog","It will be demonstrated to the stakeholders but pointed out that it’s not complete yet","The Sprint will be extended until the item is done"],"answers":[0,2],"desiredAnswers":null},{"id":"PO_1.8","text":"Awareness of which of the following is required for a Product Owner to maximize value? (choose 2 answers) *","options":["Customer feedback","Team velocity","Product Vision","Unit test results"],"answers":[0,2],"desiredAnswers":null},{"id":"PO_1.9","text":"What type of process control is Scrum? *","options":["Empirical","Traditional","Adaptive","Modern"],"answers":[0],"desiredAnswers":null},{"id":"PO_1.10","text":"How would the Product Backlog be impacted by the changes in the environment in which the product will be used? *","options":["It evolves to reflect the changes","The Product Backlog should be kept high-level enough to tolerate such changes.","The old baselined Product Backlog would be saved, and a new one would be created for the rest of the project.","There’s no effect on the Product Backlog."],"answers":[0],"desiredAnswers":null},{"id":"PO_1.11","text":"The key stakeholders are invited to the Sprint Review in order to: *","options":["​Provide feedback on the team working style","Provide feedback on Scrum implementation","Provide feedback on the Increment","Provide feedback on the technical design"],"answers":[2],"desiredAnswers":null},{"id":"PO_1.12","text":"Which statement is the least accurate about the Definition of “Done”? *","options":["The Product Owner creates it","The development organization may define it","It may vary depending on the project","It may evolve during the project"],"answers":[0],"desiredAnswers":null},{"id":"PO_1.13","text":"Who are the typical Key Stakeholders (select three)? *","options":["The people responsible for making the funding decisions for the product development effort","The people responsible for product marketing","The human people who actually use the product under development","The people responsible for paying to use the product","The people responsible for product development"],"answers":[0,2,3],"desiredAnswers":null},{"id":"PO_1.14","text":"The Product Owner doesn’t spend enough time on the project. Which of the following options is the best response from the Scrum Master? *","options":["Bring up the issue in the Sprint Retrospective","Train the Product Owner why it’s important for her/him to spend enough time on the project","Send the Product Owner to a proper training","Nominate a proxy Product Owner","Inform the Product Owner’s functional manager"],"answers":[1],"desiredAnswers":null},{"id":"PO_1.15","text":"Which of the following is required in order to order the Product Backlog? *","options":["The Product Owners' needs","Complexity","Dependencies","Risks"],"answers":[0],"desiredAnswers":null},{"id":"PO_1.16","text":"A company has three products. Which two of the following are acceptable ways of forming Scrum teams? (Choose all answers that apply) *","options":["There must be one Product Owner for each product. It is not required to have one Product Owner for two and more teams","There can be one Product Owner for each product","There can be a single Product Owner for all products","There must be a single Product Owner for all products"],"answers":[1,2],"desiredAnswers":null},{"id":"PO_1.17","text":"A four-hour Sprint Planning is common for Sprints that are … long. *","options":["One week","Four weeks","Two weeks","Three weeks","The duration of the sprint planning does not depend on the length of the sprint."],"answers":[4],"desiredAnswers":null},{"id":"PO_1.18","text":"The Product Backlog Item attributes are: *","options":["Description, order, estimate and value","Complexity, agility, openness, commitment","Commitment, courage, focus, openness and respect","Velocity, Risk, Ownership"],"answers":[0],"desiredAnswers":null},{"id":"PO_1.19","text":"To what extent does technical debt limit the value a Product Owner can get from a product? Select two answers. *","options":["Technical debt causes a greater percentage of the product's budget to be spent on maintenance of the product.","Technical debt is not a Product Owner concern, because technical debt is only an issue for the Development Team.","Technical debt does not influence the delivery of value.","The velocity at which new functionality can be created is reduced when you have technical debt."],"answers":[0,3],"desiredAnswers":null},{"id":"PO_1.20","text":"Which KVA categories should the Product Owner consider to measure and track the creation and delivery of value to the marketplace (select three)? *","options":["Employee Satisfaction","Current Value","Ability to Innovate","Capability Building","Time-to-Market"],"answers":[1,2,4],"desiredAnswers":null},{"id":"PO_2.1","text":"Technical debt leads to​ ","options":["Processes that lack tools","​A:Products that are difficult to extend and maintain","​Projects that are over-budget"],"answers":[],"desiredAnswers":null},{"id":"PO_2.2","text":"Who creates the Sprint Goal? *","options":["The Product Owner","The Development Team","The Scrum Master","The Scrum Team"],"answers":[3],"desiredAnswers":null},{"id":"PO_2.3","text":"Select the two focus areas that are not considered in executing Value Driven Development by the Product Owner. ","options":["Coach of the Development Team in self-organization and cross-functionality","Product Marketplace Expert","Product Visionary","Product Value Maximizer","Remover of impediments to the Development Team’s progress","Product Release Decision Maker","Lead Facilitator of Key Stakeholder Involvement"],"answers":[0,4],"desiredAnswers":null},{"id":"PO_2.4","text":"What is a Product Backlog? ","options":["It is a formally approved list of requirements to be implemented over a set period.","It is a detailed list of functionality from which the Development Team draws items, to be complemented by a separate Technology Backlog managed by the Development Team.","It is a living artifact of product requirements that exists and evolves as long as a product exists.","It is a list of references to Use Case documents that are stored in a central repository. The references should be viewable and clickable by anybody to enhance transparency."],"answers":[2],"desiredAnswers":null},{"id":"PO_2.5","text":"Which two statements explain why the definition of \"Done\" is important to the Product Owner?","options":["It assures the Increment reviewed at the Sprint review is usable so the Product Owner may choose to release it.","It identifies undone work that can be addressed in a separate Sprint.","It creates transparency regarding progress within the Scrum Team.","It helps the Product Owner track the open work during a Sprint."],"answers":[0,2],"desiredAnswers":null},{"id":"PO_2.6","text":"You are a product manager with a proven track record in your company. Your management has asked you to take the lead in the development of a new product. Six teams new to Scrum will build this product. You have gathered a number of requirements and ideas into an early form of a Product Backlog. How would you minimize dependencies between the Scrum Teams? *","options":["You divide Product Backlog items among the six Product Owners.","Your work with the Development Teams on how to best analyze and break apart the work.","You create an independent Product Backlog per Scrum Team.","You identify the dependencies and re-order the Product Backlog for them."],"answers":[1],"desiredAnswers":null},{"id":"PO_2.7","text":"Why should the Product Owner be present at the Daily Scrum?","options":["To hear about impediments in functionality.","To participate as a Scrum Team member.","He/She doesn´t need to be there.","To represent the stakeholders point of view."],"answers":[2],"desiredAnswers":null},{"id":"PO_2.8","text":"The Product Backlog is ordered by:","options":["Items are randomly arranged.","Risk, where safer items are at the top, and riskier items are at the bottom.","Size, where small items are at the top and large items are at the bottom.","The Product Owner with the most valuable items placed at the top"],"answers":[3],"desiredAnswers":null},{"id":"PO_2.9","text":"How often should customer satisfaction be measured?","options":["Frequently","Annualy","Daily","Quartely"],"answers":[0],"desiredAnswers":null},{"id":"PO_2.10","text":"The Development Team finds out during the Sprint that they aren´t likely to build everything they forecast. What would you expect a Product Owner to do? ","options":["Cancel the Sprint.","Re-work the selected Product Backlog items with the Development Team to meet the Sprint Goal.","Inform management that more resources are needed.","Skip Product Backlog refinement activities.","Change the Sprint Goal."],"answers":[1],"desiredAnswers":null},{"id":"PO_2.11","text":"What is Product Owner work that a Product Owner might delegate?","options":["Attending the Sprint Review.","Representing stakeholders to the Scrum team.","Writing the User Stories.","Ordering the Product Backlog."],"answers":[3],"desiredAnswers":null},{"id":"PO_2.12","text":"What is the purpose of a Sprint Review?","options":["To review the Scrum Team´s activities and processes during the Sprint.","To take time to judge the validity of the project.","To inspect the product Increment with the stakeholders and collect feedback on next steps.","To build team spirit."],"answers":[2],"desiredAnswers":null},{"id":"PO_2.13","text":"What are advantages of a Product Owner with a solid product vision? (choose the best three answers)","options":["It gives a good overall direction so Sprints will feel less like isolated pieces of work.","It helps the Scrum Team to keep focus on when the complete Product Backlog should be finished.","It´s not mandatory in Scrum. There´s not real advantage.","It is easier to inspect incremental progress at the Sprint Review.","It helps the Scrum Team keep focus and they can check any decision against it, even within a Sprint."],"answers":[0,3,4],"desiredAnswers":null},{"id":"PO_2.14","text":"The Product Owner makes sure the right stakeholders are invited to the Sprint Retrospective. They might have important instructions for team improvements.","options":["FALSE","TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_2.15","text":"A Development Team is required to deliver a done Increment by the end of a Sprint. Select two statements that explain what \"done\" means.","options":["What the Product Owner defines as quality.","No work left from the Definition of Done.","Ready for integration","All work the Development Team is willing to do.","All work to create software that is ready to be released to end users."],"answers":[1,4],"desiredAnswers":null},{"id":"PO_2.16","text":"All planned work for the Product done by the Development Team must originate from the Product Backlog.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_2.17","text":"The Product Owner should be expertly aware of the marketplace for the product.","options":["It depends.","TRUE"],"answers":[1],"desiredAnswers":null},{"id":"PO_2.18","text":"What best describes the relationship between the Product Owner and the stakeholders?","options":["The Product Owner has the final call over the requirements and should involve the stakeholders as little as possible.","The Product Owner actively asks for stakeholder input and expectations to process into the Product Backlog.","The Product Owner writes the User Stories as provided by the stakeholders.","The Product Owner provides the stakeholders with acceptance forms at the Sprint Review to record their formal agreement over the delivered software."],"answers":[1],"desiredAnswers":null},{"id":"PO_2.19","text":"When should the Increment be shipped?","options":["When it makes sense.","When the Increment is shippable.","After each Sprint.","When the Increment is free of defects."],"answers":[0],"desiredAnswers":null},{"id":"PO_2.20","text":"The Product Owner should track the performance of the project at least …","options":["Once per Sprint","Once per release","After each Daily Scrum","Once a week"],"answers":[0],"desiredAnswers":null},{"id":"PO_3.1","text":"What two phrases best describe the relationship of the Product Owner and the Development Team?","options":["They collaborate often so the Product Owner can make informed decisions in balancing effort and value of Product Backlog items.","They should share no more than the Sprint Planning and the Sprint Review meeting.","The Product Owner should be with the Development Team full-time to grow a deep understanding of the technology being used.","They collaborate often so the Development Team builds Increments keeping end-user and stakeholder concerns in mind.","They should work apart as much as possible in order to keep the concerns of business and technology separated."],"answers":[0,3],"desiredAnswers":null},{"id":"PO_3.2","text":"What two things should be done if the Product Owner is unavailable?","options":["There should be a Product Owner team to allow a different person from that team to instantly take over the role of Product Owner.","Within the Sprint, the Development Team makes the best decisions possible to assure progress toward the Sprint Goal, re-aligning with the Product Owner once he/she is available again.","Development of functional requirements stops until the Product Owner is available again.","In a permanent state of unavailability, a new Product Owner needs to be appointed. Development efforts without a Product Owner are not employing Scrum."],"answers":[1,3],"desiredAnswers":null},{"id":"PO_3.3","text":"Which description best fits the role of the Product Owner?","options":["Chief Analyst","Requirements Collector","Scope Protector","Value Maximizer","Project Manager 2.0"],"answers":[3],"desiredAnswers":null},{"id":"PO_3.4","text":"How does an organization know that a product built through Scrum is successful","options":["By releasing often, and updating key performance indicators (KPIs) on value after every release and feeding this information back into work on the Product Backlog","By measuring that velocity has increased since the last release","By measuring the actual time spent on development versus the time estimated for development","By the Product Owner and stakeholders accepting the Increment at the Sprint Review"],"answers":[0],"desiredAnswers":null},{"id":"PO_3.5","text":"The Sprint Review is the only time at which stakeholder feedback is taken into account","options":["FALSE","TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_3.6","text":"Who’s responsible for planning releases?","options":["The Scrum Team","The Scrum Master","The Project manager","The Product Owner","The Development Team"],"answers":[3],"desiredAnswers":null},{"id":"PO_3.7","text":"The Sprint Goal provides the following","options":["Flexibility to the team about the functionalities implemented in this Sprint","All the answers are right.","Common but specific goal so that team members can work together","Guidance to the team on why it is building the increment"],"answers":[1],"desiredAnswers":null},{"id":"PO_3.8","text":"The Product Owner is the sole person responsible for managing the Product Backlog.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_3.9","text":"What does the “cone of uncertainty” tell us about Scrum projects? (Choose two answers)","options":["How much is known about the Product over time","Dependencies, start times and stop times for project tasks","The uncertainty is usually highest in the first few Sprints","The uncertainty is usually highest in the last few Sprints","The uncertainty is usually lowered after the requirements are specified at the beginning of the project"],"answers":[0,2],"desiredAnswers":null},{"id":"PO_3.10","text":"What should happen to the “Done” Product Backlog items when the Sprint is cancelled?","options":["They should be moved to the next Sprint Backlog.","They will be reviewed, and if they are potentially releasable, the Product Owner typically accepts them.","They should be moved back to the Product Backlog and would be taken care of in the future Sprints."],"answers":[1],"desiredAnswers":null},{"id":"PO_3.11","text":"The Development Team should have all skills needed to...","options":["Turn Product Backlog items into Increments of releasable product.","Complete the project within the time and cost that is set by the Product Owner.","Do all the development work, and collaborate with related departments for QA, security, and similar aspects of the product."],"answers":[0],"desiredAnswers":null},{"id":"PO_3.12","text":"When does a Scrum Master cancel a Sprint?","options":["The Scrum Master doesn't have the authority to cancel the Sprint.","When not enough information is available for the items in the Sprint Backlog","When there's an unsolved technical dependency","When the Sprint Goal becomes obsolete"],"answers":[0],"desiredAnswers":null},{"id":"PO_3.13","text":"When multiple teams are working on a project, they should select work from the same Product Backlog.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_3.14","text":"Which of the following is done by the Product Owner during the Sprint?","options":["Assign tasks to developers.","Participate in the Daily Scrums to answer questions.","Update the work plan for the developers.","Answer developers' questions about items."],"answers":[3],"desiredAnswers":null},{"id":"PO_3.15","text":"Which two statements are correct about the Definition of Done?","options":["Increases transparency of the Increments.","Describes the purpose of each Sprint.","Creates a shared understanding of what has to be done for each item.","There's no need to describe tests in the Definition of Done."],"answers":[0,2],"desiredAnswers":null},{"id":"PO_3.16","text":"The Product Owner must write all of the Product Backlog items (e.g. user stories, non-functional requirements, etc.) on the Product Backlog before handing them over to the Development Team.","options":["FALSE","TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_3.17","text":"Which is NOT a valid consideration when ordering a Product Backlog.","options":["Development Team tools and techniques","Importance to customers","Alignment with business strategy and goals","Risk","Dependencies on other Product Backlog Items"],"answers":[0],"desiredAnswers":null},{"id":"PO_3.18","text":"Why would you expect a Product Owner to care about the Development Team adhering to its Definition of Done? (choose the best two answers)","options":["He doesn´t have to care. Other systems aren´t very good either.","To be able to punish the team when they don´t meet their velocity goal for the Sprint.","To have complete transparency into what has been done at the end of each Sprint.","The Definition of Done can affect the product´s total cost of ownership.","To forecast the team´s productivity over time."],"answers":[2,3],"desiredAnswers":null},{"id":"PO_3.19","text":"In the Sprint Planning meeting, the Product Owner and the Development Team were unable to reach a clear understanding about the highest order Product Backlog items. Because of this, the Development Team couldn´t figure out how many Product Backlog items it could forecast for the upcoming Sprint. They were able to agree on a Sprint Goal, however. Which of the following two actions should the Scrum Master support. ","options":["Cancel the Sprint. Send the entire team to an advanced Scrum training and then start a new Sprint.","Continue the Sprint Planning meeting past its time-box until an adequate number of Product Backlog items are well enough understood for the Development Team to make a complete forecast. Then start the Sprint.","Ask everyone to take as much time as needed to analyze the Product Backlog first, and then reconvene another Sprint Planning meeting.","Forecast the most likely Product Backlog items to meet the goal and create a Sprint Backlog based on a likely initial design and plan. Once the time-box for the Sprint Planning meeting is over, start the Sprint and continue to analyze, decompose, and create additional functionality during the Sprint.","Discuss in the upcoming Sprint Retrospective why this happened and what changes will will make it less likely to recur."],"answers":[3,4],"desiredAnswers":null},{"id":"PO_3.20","text":"The \"cone of uncertainty\" can be used to do what?","options":["Project what will be complete by a given Sprint.","Determine the cost of a project before it is begun.","Illustrate that, as a forecast lengthens, it is increasingly less certain.","Determine whether to cut quality, similar to the \"Iron Triangle\" of software development."],"answers":[2],"desiredAnswers":null},{"id":"PO_4.1","text":"What two things best help the Product Owner manage the value of a product?","options":["Setting value on individual Product Backlog items using Value Poker","Validating assumptions of value through frequent releases","Devising a formula for a neutral calculation of value","The order of the Product Backlog"],"answers":[1,3],"desiredAnswers":null},{"id":"PO_4.2","text":"The Product Owner's authority to change and update the Product Backlog is unlimited, except for:","options":["Technical and architectural work that needs to be done first, as indicated by the chief enterprise architect.","High impact changes that have not been approved by the change request board.","Decisions by the CFO, the CEO or the board of directors.","Nothing. The entire organization must respect a Product Owner's decisions.","Decisions by the chief program manager.","Work for which impediments exist that the Scrum Master still needs to resolve."],"answers":[3],"desiredAnswers":null},{"id":"PO_4.3","text":"A Product Owner is essentially the same thing as a traditional Project Manager?","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_4.4","text":"The value delivered by a product can only be determined by revenue.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_4.5","text":"The Product Owner may delegate some of his/her accountabilities to the developers.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_4.6","text":"Throughout the Sprint, the Development Team tracks the remaining work and the trend. At a minimum, the remaining work must be updated","options":["Every week","Every day","Whenever the Scrum Master gets the time"],"answers":[1],"desiredAnswers":null},{"id":"PO_4.7","text":"How should the Product Owner forecast the completion date?","options":["This is the responsibility of the Scrum Master to forecast the completion date","By using a trend line in the burn-down chart","By any method she or he finds appropriate","By dividing the remaining amount of work in the Product Backlog to the latest calculated velocity"],"answers":[2],"desiredAnswers":null},{"id":"PO_4.8","text":"Select the two meetings in which people outside the Scrum Team are allowed to participate.","options":["The Sprint Review","The Sprint Retrospective","The Sprint Planning","The Daily Scrum"],"answers":[0,2],"desiredAnswers":null},{"id":"PO_4.9","text":"Who’s responsible for Gantt Charts in Scrum?","options":["The Product Owner","The Scrum Master","It is not required in Scrum","The project manager","The Development Team"],"answers":[2],"desiredAnswers":null},{"id":"PO_4.10","text":"Which element is NOT an attribute of Product Backlog items?","options":["Owner","Description","Estimate","Value"],"answers":[0],"desiredAnswers":null},{"id":"PO_4.11","text":"Which of the following has the most to do with capturing and using lessons learned?","options":["Sprint Review","Sprint Retrospective","Sprint Planning","Product Backlog Refinement"],"answers":[1],"desiredAnswers":null},{"id":"PO_4.12","text":"There are no testers in Scrum.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_4.13","text":"Which two of the following are outcomes of Daily Scrums?","options":["Everyone is clear on the next steps toward the Sprint Goal.","The Scrum Master identifies new impediments.","The Product Owner is informed of the progress.","The impediments are discussed and possible solutions selected."],"answers":[0,1],"desiredAnswers":null},{"id":"PO_4.14","text":"What's the role of a Product Owner in composing the Sprint Goal?","options":["The Product Owner is not involved; the Sprint Goal is created by the Development Team.","They prepare the Sprint Goal and bring it to the Sprint Planning meeting, to be used as a guide for planning the Sprint.","They bring business objectives to the Sprint Planning meeting, and they work with the rest of the team to craft the Sprint Goal.","They work with the customer to create a Sprint Goal."],"answers":[2],"desiredAnswers":null},{"id":"PO_4.15","text":"The customer goes to the Development Team in the middle of a Sprint, and asks them to add an important item to the Sprint Backlog. What should they do?","options":["Reject the request.","Add the item to the current Sprint Backlog.","Refer the customer to the Product Owner.","Add the item to the next Sprint Backlog."],"answers":[2],"desiredAnswers":null},{"id":"PO_4.16","text":"Which statement best describes the Product Backlog?","options":["It's used to create the project plan.","Contains all tasks identified by the developers.","Contains only small and clear items.","The customer's change requests are reflected in it."],"answers":[3],"desiredAnswers":null},{"id":"PO_4.17","text":"Which two statements are correct about Daily Scrums?","options":["It's 15 minutes only if the Sprint is one month long.","Only the developers participate in the meeting.","It's held at the same time and place every day.","It's timeboxed for 2 minutes per developer.","No one other than the Development Team is allowed to be there."],"answers":[1,2],"desiredAnswers":null},{"id":"PO_4.18","text":"The Product Owner is not collaborating with the developers during the Sprint. What would you do as the Scrum Master?","options":["Cancel the Sprint and start training the Product Owner.","Coach the Product Owner to understand why collaboration is important in Scrum and how it can affect the value of the product.","Nominate someone else as the proxy Product Owner.","Talk to the functional manager of the Product Owner."],"answers":[1],"desiredAnswers":null},{"id":"PO_4.19","text":"Which two of the following can be considered real outputs of the Sprint?","options":["A piece of software that is usable by the end users","A plan for the next Sprints","New features that are ready for integration","A potentially releasable piece of software"],"answers":[0,3],"desiredAnswers":null},{"id":"PO_4.20","text":"The Definition of Ready may be adjusted and improved during the project.","options":["FALSE","TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_5.3","text":"What is the accountability of the Product Owner during Sprint 0 (Zero)?","options":["Make sure enough Product Backlog items are refined to fill the first 3 Sprints.","Gathering, eliciting, and analyzing the requirements that will be inserted into the Product Backlog.","Make the complete project plan to commit date, budget and scope to the stakeholders.","Determine the composition of the Development Teams so they have the capacity to deliver the completed forecast.","There is no such thing as Sprint 0."],"answers":[4],"desiredAnswers":null},{"id":"PO_5.5","text":"What does the Sprint burn-down chart show?","options":["The evolution of the amount of uncertainty during a project","How much work remains until the end of the Sprint","Dependencies, start times and stop times for project tasks","Hierarchy of tasks that comprise a project"],"answers":[1],"desiredAnswers":null},{"id":"PO_5.6","text":"How does an organization know that a product built through Scrum is successful? (choose 2 answers)","options":["Reduced costs","Increased customer satisfaction","Delivering an increment every Sprint","Through frequent releases and meeting value metrics or KPIs","Improve the velocity"],"answers":[1,3],"desiredAnswers":null},{"id":"PO_5.7","text":"The Product Owner is using burn-up charts instead of burn-down charts. What would be your response as the Scrum Master?","options":["There’s nothing wrong with it.","Burn-up charts are used in traditional methods and should be replaced by burn-down charts."],"answers":[0],"desiredAnswers":null},{"id":"PO_5.8","text":"When does the adaptation occur in Scrum?","options":["During the Scrum events","Only at the Sprint Review","At the Daily Scrum","During the Sprint Planning"],"answers":[0],"desiredAnswers":null},{"id":"PO_5.9","text":"The Product Owner should use user stories to compose the Product Backlog items.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_5.11","text":"How can a Product Owner use time-boxed Sprints to obtain feedback from users and the market?","options":["Through the assurance that a Development Team finishes all work on the Sprint Backlog.","Through frequent delivery of Increments of the product into the market.","By making sure a Sprint does not stop until all testing is done, and the work is verified by the Product Owner.","At the end of each Sprint, a detailed report with all test cases and test results is available.","A business analyst represents the Product Owner to make decisions on his behalf during the Sprint. This way the Product Owner can accept the work at the Sprint Review without further involvement."],"answers":[1],"desiredAnswers":null},{"id":"PO_5.12","text":"The process of regular inspection and adaptation employs knowledgeable and skilled inspectors. What are two ways in which the Product Owner takes the lead in the inspection process?","options":["At the Sprint Review the Product Owner shares the current state of Product Backlog, which, combined with the inspection of the Increment, leads to an updated Product Backlog.","At the Daily Scrum the Product Owner inspects the Sprint burn-down for progress towards a complete Increment and re-planning the team's work.","At the end of Sprint Planning the Product Owner verifies the Sprint Backlog for completeness in order to allow the Sprint to start.","The Product Owner invites stakeholders to the Sprint Review to learn how the current state of the marketplace influences what is the most valuable thing to do next."],"answers":[0,3],"desiredAnswers":null},{"id":"PO_5.13","text":"The Product Owner manages the Product Backlog. Who is accountable for estimating the effort to complete the Product Backlog items?","options":["The Development Team. As a collective, they have a complete view of the work needed to transform Product Backlog items into Increments of product.","The PMO. They have all the history on projects delivered, and this enables the IT department to make delivery commitments.","The Product Owner. The Product Owner is required to commit on delivery to the users and the stakeholders."],"answers":[0],"desiredAnswers":null},{"id":"PO_5.14","text":"A Scrum Team has been working on a product for 9 Sprints. A new Product Owner comes in, understanding he is accountable for Product Backlog. However, he is unsure about the purpose of the Product Backlog. He's read that the Product Backlog should be a list of all user features for the product. He goes to the Scrum Master asking where to put the other types of requirements that are going to be taken into account. Are all of the following types of requirements acceptable on a Product Backlog? (Stability requirements, Performance requirements, Product Functionality, Documentation, Fixes)","options":["Yes, they all belong on the Product Backlog. Product Backlog is supposed to be the 'single source of truth' for all the work for the product.","No. Product Backlog is a tool for the Product Owner. The Product Owner represents the users and stakeholders. Other types of requirements should be managed separately by the Development Team. They are not the Product Owner's concern."],"answers":[0],"desiredAnswers":null},{"id":"PO_5.15","text":"Scrum is based on empirical process control theory. All of its artifacts must be transparent to ensure sufficient accuracy of inspection. Which two measures ensure that the Product Backlog is transparent?","options":["The Product Backlog only has work for the next 2 Sprints.","Each Product Backlog item has a MoSCoW priority.","The Product Backlog is ordered.","The Product Backlog is managed using a web-based tool.","The Product Backlog is available to all stakeholders."],"answers":[2,4],"desiredAnswers":null},{"id":"PO_5.16","text":"In the middle of the Sprint, the customer decides that there are 2 new features she wants. The Product Owner could: (choose the best two answers)","options":["lntroduce these features at the next Daily Scrum.","Add it to the Product Backlog.","Ask the Development Team to consider whether they can add these features to the current Sprint.","Have the Scrum Master add these features to the current Sprint."],"answers":[1,2],"desiredAnswers":null},{"id":"PO_5.17","text":"A Product Owner can measure success by an increase in the team's velocity","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_5.18","text":"Which of the following are criteria to order Product Backlog items? (choose all that apply)","options":["Value of Product Backlog items.","Dependencies between Product Backlog items.","Dependencies to other products.","All of the answers are right."],"answers":[3],"desiredAnswers":null},{"id":"PO_5.19","text":"Software dependencies could influence how the Product Owner orders Product Backlog ltems","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_5.20","text":"Sprint burndown charts are an efficient tracking tool, because they show","options":["How many hours have been worked by each Development Team member.","How much effort has gone into a Sprint.","An estimate of the total work remaining for the Sprint.","How many Product Backlog items remain."],"answers":[2],"desiredAnswers":null},{"id":"PO_6.1","text":"During a Sprint Review, the stakeholders notice that the product development progress is not very clearly visible and lacked transparency. Moreover, they are not able to understand the team’s next steps. Who bears the primary responsibility for this status?","options":["Scrum Team","Scrum Master","Product Owner","Development Team"],"answers":[2],"desiredAnswers":null},{"id":"PO_6.2","text":"A Development Team is requested by an important stakeholder to help them with some external task, since it is urgently required by organization board. The team referred them to Product Owner. In this case, the Scrum Master","options":["Should do nothing, since the team’s action was correct.","Should coach the team to support senior management requirements.","Should form a sub team that can take up such external requests"],"answers":[0],"desiredAnswers":null},{"id":"PO_6.5","text":"The Product Owner is responsible for preparing the Sprint Goal before the Sprint Planning.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_6.6","text":"Which options are acceptable when the Product Owner wants to be informed of the progress in the middle of the Sprint? (Choose two answers)","options":["Attend the Daily Scrums.","Ask the Scrum Master for daily briefs.","Check the task board in the project room (if exists).","Ask the Development Team for daily reports.","Ask the team leader for daily briefs."],"answers":[0,2],"desiredAnswers":null},{"id":"PO_6.7","text":"Which of the following can be considered for ordering the Product Backlog?","options":["Importance","Risk","Costs","User Story size"],"answers":[0],"desiredAnswers":null},{"id":"PO_6.8","text":"What’s the most important metric for a Product Owner to measure, in order to make the progress of the project clear?","options":["The lines of code created","The forecasted completion date","The velocity"],"answers":[1],"desiredAnswers":null},{"id":"PO_6.9","text":"There is one Product Backlog for a Nexus.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_6.10","text":"All Development Team members must attend the Nexus Daily Scrum","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_6.11","text":"Select two ways in which technical debt impacts transparency.","options":["When calculated and estimated, the total amount of technical debt shows exactly how long until the Product Owner can release the Increment.","It enhances transparency for the Product Owner as a Development Team is not allowed to do additional feature development in a Sprint as long as there is technical debt.","As development progresses and code is added, the system becomes more difficult to stabilize, which results in future work being slowed down in unpredictable ways.","It leads to false assumptions about the current state of the system, specifically of an Increment being releasable at the end of a Sprint."],"answers":[2,3],"desiredAnswers":null},{"id":"PO_6.12","text":"What is the primary purpose of the first part of the Nexus Sprint Retrospective, when representatives from across the Nexus meet?","options":["To identify dependencies between teams.","To identify the one item teams should discuss during their individual Sprint Retrospective.","To discuss what went well during the Sprint.","To identify issues that impact multiple teams."],"answers":[3],"desiredAnswers":null},{"id":"PO_6.13","text":"A Nexus Integration Team is responsible for actually doing the integration work during the Sprint.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_6.15","text":"How small should a \"ready\" Product Backlog item be? ","options":["It should fit on a small index card.","No longer than one day.","Small enough to build in 1 Sprint.","Small enough for a single team member to complete in a Sprint.","No bigger than 8 story points."],"answers":[2],"desiredAnswers":null},{"id":"PO_6.16","text":"A Development Team selects a set of Product Backlog items for a Sprint Backlog with the intent to get the selected items \"Done\" by the end of the Sprint. Which three phrases best describe the purpose of a definition of \"Done\"? (choose the best three answers)","options":["It provides a template for elements that need to be included in the technical documentation.","It tracks the percent completeness of a Product Backlog item.","It guides the Development Team in creating a forecast at the Sprint Planning.","It defines what it takes for an Increment to be ready for release.","It creates transparency over the work inspected at the Sprint Review.","It controls whether the developers have performed their tasks."],"answers":[2,3,4],"desiredAnswers":null},{"id":"PO_6.18","text":"Product Owners must create clear and unambiguous acceptance criteria for each Product Backlog item before it may be selected in Sprint Planning.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_7.2","text":"Throughout the effort, who takes the ownership of scrum events, sets-up the meeting for every event, and invites the required participants?","options":["Product Owner","Scrum Team","Scrum Master","Project Manager","PMO"],"answers":[1],"desiredAnswers":null},{"id":"PO_7.3","text":"A Product Owner cannot send a representative (delegate) to the Sprint Review.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_7.4","text":"Choose two true statements:","options":["Product Owner's decisions are visible in the Sprint Backlog content","Product users are the most important stakeholders","The utmost priority of the Product Owner is to maximize the value of the product","Development Team can't act on directions from anyone other than Product Manager"],"answers":[1,2],"desiredAnswers":null},{"id":"PO_7.5","text":"Who is responsible for quality in Scrum?","options":["Everyone who performs the development work","Tester","Product Owner","Scrum Master"],"answers":[0],"desiredAnswers":null},{"id":"PO_7.8","text":"The Product Owner is accountable for the result and therefore should have the final say over the definition of “Done”.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_7.9","text":"Which statement best describes the definition of “Done”?","options":["Everything that would make the output potentially releasable","Passing the QA and having all the required documents","Anything that the Product Owner finds necessary"],"answers":[0],"desiredAnswers":null},{"id":"PO_7.10","text":"The increment is valuable in these cases (Choose two answers)","options":["It is delivered on time","It increases customer satisfaction","It reduces long-term operational costs","It has all the features that the Product Owner expected"],"answers":[1,2],"desiredAnswers":null},{"id":"PO_7.14","text":"How should a Product Backlog item be refined before its development begins? (Choose two answers)","options":["It should be clear which developer is responsible for it.","In a way that it’s clear enough for the developers.","All the tasks required for completing it should be identified.","In a way that it can be “Done” in the time-boxed duration of one Sprint"],"answers":[1,3],"desiredAnswers":null},{"id":"PO_7.15","text":"The performance of the Sprint should be measured at least...","options":["Before or after each release","Once a day","Once per Sprint","Once a week"],"answers":[1],"desiredAnswers":null},{"id":"PO_7.16","text":"Which statement does NOT explain when an item is considered complete?","options":["When everything is Done based on the Definition of Done","When it can be part of a potentially releasable Increment","When it's potentially usable for the end users, if it becomes part of the Increment","When all identified tasks are done"],"answers":[3],"desiredAnswers":null},{"id":"PO_7.18","text":"What type of test should be done during the Sprint?","options":["Unit tests","All tests, except for user acceptance tests","Every type of test","All tests, except for integration tests"],"answers":[2],"desiredAnswers":null},{"id":"PO_7.20","text":"Which two of the following may be done in the Sprint Retrospective meeting?","options":["Discuss tools used to communicate with remote team members","Discuss the Product Backlog items for the next Sprint","Calculate Velocity","Discuss the relationship the team has with the customer and the way user acceptance testing is done"],"answers":[0,3],"desiredAnswers":null},{"id":"PO_8.2","text":"The Scrum Master can also be a member of the Development Team","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_8.3","text":"Which of the following best describes the way a Product Owner can order the items in the Product Backlog?","options":["Based on size; smaller items at the top","Based on risk; riskier items at the top","Based on value, priority, dependencies, and risk","Based on what the customer asks for"],"answers":[2],"desiredAnswers":null},{"id":"PO_8.4","text":"Which two of the following describe when a Product Backlog item is ready to be developed.","options":["When it's small enough to fit in one Sprint","When the item is refined, and has a clear meaning","When it's small enough to fit on a sticky note","When it's small enough to be developed by one developer in one Sprint","When it's a real User Story, not an Epic"],"answers":[0,1],"desiredAnswers":null},{"id":"PO_8.5","text":"How is the Product Backlog impacted by changes in the environment in which the product will be used?","options":["The Product Backlog should be kept high-level enough to tolerate such changes.","There’s no effect on the Product Backlog.","The old baselined Product Backlog would be saved, and a new one would be created for the rest of the project.","It evolves to reflect the changes"],"answers":[3],"desiredAnswers":null},{"id":"PO_8.6","text":"In scaled Scrum (Nexus), each team demonstrates their individual Increment in a separate branch of the code.","options":["FALSE","TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_8.7","text":"The Product Owner believes that the current velocity won't be sustainable. What could be the reason?","options":["Possibility of having extreme changes in the future.","High technical debt","Possibility of having more items added to the Product Backlog","Having only low value items remaining in the Product Backlog"],"answers":[1],"desiredAnswers":null},{"id":"PO_8.8","text":"Who estimates the size of the Product Backlog items?","options":["The Scrum Master","The Development Team","The Product Owner","The Scrum Team"],"answers":[1],"desiredAnswers":null},{"id":"PO_8.9","text":"Why is it advantageous to release Increments? (Select two answers)","options":["This forces the developers to make the Increments releasable.","A large number of users will start using the product (instead of a few representatives) and generate more useful feedback.","This helps reduce the amount of extra work needed for a one-time release at the end of the project.","The customer can start its operation and earn money."],"answers":[1,3],"desiredAnswers":null},{"id":"PO_8.10","text":"Each Scrum Team should have a Scrum Master and a Product Owner.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_8.11","text":"Which two statements are correct about an item that is in-progress at the end of the Sprint?","options":["It can be added to the Increment if the customer accepts it.","It can be added to the Increment if the user acceptance tests are done.","Demonstrate it in the Sprint Review meeting, if the item is presentable in its current state.","Do not include it in the Increment.","Move it back to the Product Backlog."],"answers":[3,4],"desiredAnswers":null},{"id":"PO_8.12","text":"Which three of the following are used to measure a product's success?","options":["Velocity","Impact on cost","Having short Sprint Review meetings","Impact on revenue","Having all Sprint Backlog items delivered by the end of the Sprint","Customer satisfaction"],"answers":[1,3,5],"desiredAnswers":null},{"id":"PO_8.13","text":"Which two of the following are NOT allowed in Scrum?","options":["Release Sprints","Refactoring","Integration Sprints","Release Planning","Using Planning Poker"],"answers":[0,2],"desiredAnswers":null},{"id":"PO_8.14","text":"An organization has decided to adopt Scrum. Which three of the following describe what happens if they tailor the Scrum terminology to match their current environment?","options":["It's necessary to tailor Scrum to suit the project.","The change might not be obvious to everyone, and therefore very little change actually happens.","Management may feel less enthusiastic about the change.","The change might not be obvious to everyone, and some benefits may be lost."],"answers":[1,2,3],"desiredAnswers":null},{"id":"PO_8.15","text":"To get started in terms of what to build, Scrum requires no more than a Product Owner with enough ideas for a first Sprint, a Development Team to implement those ideas and a Scrum Master to help guide the process.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_8.16","text":"When should the Product Backlog be refined? (choose the best two answers)","options":["The Product Owner and the Development Team do it in the 1-2 preceding Sprints.","The Product Owner takes the time between the Sprints to do it.","Business analysts in the organization should do this work for the Scrum Team 1-2 Sprints ahead of the development Sprints.","The Product Owner must do this as essential work in Sprint 0.","The Product Owner and the Development Team do it in the actual Sprint if they haven't been able to do it in preceding Sprints."],"answers":[0,4],"desiredAnswers":null},{"id":"PO_8.17","text":"Which is the most important stakeholder Product Owners must satisfy","options":["The company owner or shareholders.","Executive staff.","The Chief Product Owner.","The Product's users."],"answers":[3],"desiredAnswers":null},{"id":"PO_8.18","text":"The Product owner must use:","options":["Project Gantt chart","Critical Path Analysis","Feature burn-up.","Release burndown diagram.","None of the answers are right","Burndown chart.","Refactoring"],"answers":[4],"desiredAnswers":null},{"id":"PO_8.19","text":"The top priority items of the Product Backlog should be analyzed, estimated, and prioritized adequately to begin a Sprint. This is referred to as an actionable, or \"Ready\", Product Backlog. At the start of the Sprint Planning meeting, select the best description of the Product Backlog items that the Product Owner wants to have done. ","options":["They are clearly stated, refined, and understood by the Product Owner and the Development Team such that a forecast of items can be made to implement the Sprint Goal.","They are stated as User Stories or use cases and test cases must have been identified for acceptance.","They are fully described as User Stories or use cases already decomposed into tasks that will require no more than one-person day to complete by the Development Team.","They are stated as User Stories and cannot be epics."],"answers":[0],"desiredAnswers":null},{"id":"PO_8.20","text":"Why is it important that there is only one Product Owner per product? (choose the best three answers)","options":["The Development Team always knows who determines priorities.","The Scrum Master knows who will be his back-up whenever he goes on vacation.","It helps avoid barriers to effective communication and rapid decision-making.","It helps the economy by increasing employment.","It is clear who is accountable for the ultimate success of the product."],"answers":[0,2,4],"desiredAnswers":null},{"id":"PO_9.1","text":"Development Team members may also serve on the Nexus Integration Team.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_9.2","text":"Many Development Teams working in the same code creates coordination problems which can be sufficiently addressed with a comprehensive branching and merging model in shared version control. ","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_9.3","text":"The purpose of the Nexus Integration Team is to: (Choose 2 answers)","options":["Integrate all the Development Teams' work.","Be accountable that an Integrated Increment is produced.","Raise transparency.","Manage the Nexus."],"answers":[1,2],"desiredAnswers":null},{"id":"PO_9.4","text":"The developers forecast that 5 out of 12 items they have in the Sprint Backlog won't be done by the end of the Sprint. What should they do?","options":["Review the work with the Product Owner to see if any adjustments are required, and keep working.","Continue to the next Sprint without a Sprint Review meeting and finish those items in the next Sprint.","Work overtime and try to complete all items.","Extend the duration of the Sprint, to be able to deliver everything."],"answers":[0],"desiredAnswers":null},{"id":"PO_9.5","text":"The content of the Sprint Backlog emerges during the Sprint. ","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_9.8","text":"Having feature teams instead of component teams helps keep them cross-functional. ","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_9.9","text":"A baselined Product Backlog is called ... .","options":["Sprint Backlog","The Product Backlog is not baselined.","Product Vision","Release Plan"],"answers":[1],"desiredAnswers":null},{"id":"PO_9.14","text":"A Project Manager working with your Scrum Team has raised concerns about progress and money spent. What are the two best responses? (choose the best two answers)","options":["Share the current impediments.","Show the Earned Value Analysis (EVA) report.","Scrum doesn't have Project Managers so disregard their concerns.","Share the Product Backlog and the forecast for the Sprint.","Share the last stakeholder briefing document prepared by the Product Owner."],"answers":[0,3],"desiredAnswers":null},{"id":"PO_9.15","text":"In order to maximize the value of the product, a Product Owner needs awareness of the following: (choose the best answer)","options":["Forecasting & feasibility.","Competitive research.","Customer feedback.","Product vision.","None of the answers are right.","All of the answers are right."],"answers":[5],"desiredAnswers":null},{"id":"PO_9.17","text":"How much of the Sprint Backlog must be defined during the Sprint Planning event?","options":["The entire Sprint Backlog must be identified and estimated by the end of the Sprint Planning meeting.","Just enough tasks for the Scrum Master to be confident in the Development Team's understanding of the Sprint.","Just enough to understand design and architectural implications.","Enough so the Development Team can create its best forecast of what it can do, and to start the first several days of the Sprint."],"answers":[3],"desiredAnswers":null},{"id":"RB_9.19","text":"What is typical work for a Product Owner in a Sprint? (choose the best two answers)","options":["Nothing.","Work with the Development Team on Product Backlog refinement.","Update the work plan for the Development Team on a daily basis.","Collaborate with stakeholders, user communities and product managers.","Attend every Daily Scrum to answer functional questions on the discussed Sprint Backlog items.","Create financial reporting upon the spent hours reported by the Development Team."],"answers":[1,3],"desiredAnswers":null},{"id":"PO_9.20","text":"An organization has decided to adopt Scrum, but management wants to change the terminology to fit with terminology already used. What will likely happen if this is done?","options":["Without a new vocabulary as a reminder of the change, very little change may actually happen.","The organization may not understand what has changed within Scrum and the benefits of Scrum may be lost.","Management may feel less anxious.","All answers apply."],"answers":[3],"desiredAnswers":null},{"id":"PO_10.3","text":"My job as a Product Owner focuses on the following: (choose the best two answers)","options":["Working with customers and stakeholders to identify the most important product requirements.","Clearly communicating project or release status and strategies to customers and stakeholders.","Writing clear, transparent User Stories.","Being with the Scrum team all the time, just in case they need me to clarify a requirement."],"answers":[0,1],"desiredAnswers":null},{"id":"PO_10.4","text":"Product Owners must specify complete acceptance criteria for a Product Backlog item before the team can select the item in Sprint Planning.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_10.5","text":"How much time must a Product Owner spend with the Development Team? ","options":["Enough so that the Product Owner is not surprised by the value delivered by the Increment.","40%, or more if the stakeholders agree.","However as much time the Development Team asks the Product Owner to be present.","1"],"answers":[0],"desiredAnswers":null},{"id":"PO_10.6","text":"What three things might a Scrum Product Owner focus on to ensure his product delivers value? (choose the best three answers)","options":["Minimizing changes to project scope","The size of his product in \"lines of code\". 0%","How much of the functionality of his product is being utilized.","Direct customer feedback.","How readily his product can be absorbed and used by his customers."],"answers":[2,3,4],"desiredAnswers":null},{"id":"PO_10.7","text":"Which metrics will help a Product Owner establish that value is being delivered? (choose the best two answers)","options":["Customer satisfaction.","Time to market.","Scope implemented.","Velocity.","Productivity."],"answers":[0,1],"desiredAnswers":null},{"id":"PO_10.8","text":"An important pillar of Scrum is the management principle of self-organization. Select two ways that time-boxing promotes self-organization. (choose the best two answers)","options":["Time-boxes do not allow enough time for stringent processes or meeting overhead.","Time-boxing protects the Development Team from the Product Owner so developers can actually focus.","Time-boxes eliminate politics and bureaucracy.","Teams can determine on their own how much overtime is acceptable for a time­box, generally expressed as a percentage of the time-box.","Time-boxes encourage the people who are closest to the problem to create the best possible result in the time allotted, given the current context.","Time-boxes help everyone focus on the same problem at the same time."],"answers":[4,5],"desiredAnswers":null},{"id":"PO_10.9","text":"Management has planned for over two hundred (200) developers to work on a new, critical product. Prior to them being formed into teams and beginning to develop the software, an overall architecture and integrating design is needed. Which of the following approaches employs Scrum and Agile principles most effectively? ","options":["Have the best designers and developers create an appropriate design and architecture. Include design models that the rest of the developers will include while implementing features.","Form one or two teams of the best developers to create a foundation that represents the non-functional requirements and also several high value functions. Then increase the number of teams using the shared architecture.","Form a team of architects and designers. This team will serve as consultants to the other Scrum teams as integration questions arise during development.","Design and instantiate an appropriate Service Oriented Architecture (SOA) before beginning feature development. Train Development Teams on how to consume the shared SOA in their feature development. Then begin feature development Sprints."],"answers":[1],"desiredAnswers":null},{"id":"PO_10.10","text":"What are two ways a Development Team can ensure a good application architecture? (Choose 2 answers)","options":["The Development Team focuses only on adding functionality. The architecture will take care of itself as the Development Team adds functionality.","Architecture is an ongoing discussion in the Development Team, focusing on implementing current Sprint Backlog items.","The Development Team has a set of guiding architecture principles that every Development Team member understands and follows when writing code.","The Development Team uses a Sprint O to create infrastructure that will be needed later."],"answers":[1,2],"desiredAnswers":null},{"id":"PO_10.11","text":"From the list below, what two factors should be most considered when establishing the length of a Sprint? (Choose 2 answers)","options":["The frequency at which team formation can be changed.","The risk of being disconnected from the stakeholders.","The level of uncertainty over the technology to be used.","All teams in a Nexus must have the same Sprint length.","The Nexus Integration Team should determine the Sprint length for all individual Scrum Teams."],"answers":[1,2],"desiredAnswers":null},{"id":"PO_10.12","text":"Four (4) teams in a Nexus are reporting that it takes many hours or days to diagnose integration issues. To address this issue, which technical practice/tool/behavior would best help?","options":["Continuous Integration.","Behavior Driven Development.","Automated acceptance testing.","All of the above.","Exploratory Testing.","Requirements Traceability."],"answers":[0],"desiredAnswers":null},{"id":"PO_10.13","text":"What does it mean when we say that a Product Backlog item is “Done”? (Choose three answers)","options":["The item can be a part of a potentially releasable piece of software","The item is ready for user acceptance testing","No work left based on the Definition of Done","The item creates software that is usable by the end user","All tasks identified for the item are done"],"answers":[0,2,3],"desiredAnswers":null},{"id":"PO_10.14","text":"What should the Product Owner do in the middle of the Sprint, when the Development Team realizes they are not able to finish all the Sprint Backlog items?","options":["Help the developers adjust their work and meet the Sprint Goal","Cancel the Sprint","Remove some of the Product Backlog items from the Sprint Backlog","Ask management for more resources"],"answers":[0],"desiredAnswers":null},{"id":"PO_10.16","text":"When is it time to integrate the solution?","options":["Before releasing the Increment","At the end of the project","At the end of the Sprint","During the Sprint"],"answers":[3],"desiredAnswers":null},{"id":"PO_10.19","text":"Which of the following is the responsibility of the Product Owner? (choose 3 answers) ","options":["Breakdown epic user stories into smaller ones","Create Product Backlog Items","Design software","Prioritize the Product Backlog","Volunteer for tasks"],"answers":[0,1,3],"desiredAnswers":null},{"id":"PO_11.2","text":"Who creates the definition of \"Done\"?","options":["The development organization (or Development Team if none is available from the development organization)","The Scrum Team, in a collaborative effort where the result is the common denominator of all members' definitions","The Product Owner as he/she is responsible for the product's success","The Scrum Master as he/she is responsible for the Development Team's productivity"],"answers":[0],"desiredAnswers":null},{"id":"PO_11.5","text":"Learning turns into 'validated learning' when assumptions and goals can be assessed through results. What is a key way for a Product Owner to apply validated learning?","options":["Release an Increment to the market to learn about the business assumptions built into the product.","Accept an Increment at the Sprint review to learn about the forecast of functionality that was developed.","Set the Sprint Goal before selecting Product Backlog items at Sprint Planning to learn about a Development Team's productivity."],"answers":[0],"desiredAnswers":null},{"id":"PO_11.8","text":"Which of the following limits work in progress? ","options":["Having Sprint Reviews","Having Sprint Retrospectives","Using Product Backlogs","Using timeboxes"],"answers":[3],"desiredAnswers":null},{"id":"PO_11.9","text":"Some items in Sprint Backlogs are not directly about the features and functions of the product.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_11.10","text":"The Definition of Done is composed by the Product Owner, to ensure that the Increments will be usable by the end-users. ","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_11.11","text":"How much time do the developers spend on Product Backlog Refinement?","options":["Usually not more than 20% of their time","As much as needed","Usually not more than 5% of their time","Usually not more than 10% of their time"],"answers":[3],"desiredAnswers":null},{"id":"PO_11.12","text":"Which of the following is a pillar of Scrum?","options":["Collaboration","Sustainable pace","Value optimization","Adaptation"],"answers":[3],"desiredAnswers":null},{"id":"PO_11.14","text":"Several Sprints into a project, the Product Owner tells the Scrum Master that a key stakeholder just started using the product. The stakeholder is unhappy with the slow performance. What are two good options for the Scrum Master?","options":["Coach the Product Owner on how to talk with the Development Team about this concern.","Encourage the Product Owner to put performance on the Product Backlog and express the stakeholder´s concern to the Development Team.","Explain to the Product Owner that it´s up to the Development Team to decide on acceptable performance standards.","Bring the concern to the testers to improve how the system is tested .","Wait to bring this up until the Sprint Retrospective."],"answers":[0,1],"desiredAnswers":null},{"id":"PO_11.15","text":"User documentation is part of your definition of “Done”. However, there aren´t enough technical writers for all teams. Your Development Team doesn`t have a technical writer. What should you do?","options":["Form a separate team of technical writers that will work on an on-demand basis for the various Product Owners. Work order will be first in, first out.","Let the user documentation remain undone and accumulate until after the last development Sprint. It will then be done by any available technical writers.","Wait until you have a technical writer on your Development Team to take care of this.","Your Development Team is still responsible for creating user documentation. In this case, the Development Team members will write it."],"answers":[3],"desiredAnswers":null},{"id":"PO_11.16","text":"What are two good answers a Scrum Master might give their manager and Product Owner when they say they have allocated budget for a first Sprint to figure out architecture and infrastructure issues?","options":["Agree that architecture and infrastruture are best handed before starting Scrum.","Encourage the Product Owner to include some business functionality in the Sprint.","Explain the best architecture and infrastruture emerge alongside the development of functionality.","Explain that Sprints are time-boxed and that one Sprint may not be enough to fully determine architecture.","Explain that the developers will reach out to the system architect when needed during each Sprint Planning meeting."],"answers":[1,2],"desiredAnswers":null},{"id":"PO_11.17","text":"Which of the following best describes an increment of working software?","options":["An automated test suite to verify functionality delivered in previous iterations","A decomposition of all Product Backlog terms into tasks for future Sprint Backlog lists","UML diagrams that describe how to deliver functionality in future iterations","Additional features in a useable state that complement those in previous iterations","A new user interface design for functionality delivered in previous iterations"],"answers":[3],"desiredAnswers":null},{"id":"PO_11.19","text":"Which three behaviours demonstrate that a team is self-organizing? (Choose the best three answers) ","options":["The Development Team inviting external people to the Sprint Planning to ask them how to turn a Product Backlog item into a Increment via a complete and detailed Sprint Backlog","The Development Team creating their own Sprint Backlog, reflecting all work that is part of the Definition of “Done”","The Product Owner doesn´t need to be at Sprint Retrospectives.","The Development Team has all the skills needed to create a releasable Increment.","Stakeholders walking in at the Daily Scrum to check progress and work with the Scrum Master to optimize the functional scope for the Sprint.","The Development Team members are working within the boundaries of their functional description and nicely handing off work from analyst to developer to tester to integration","Development Team members collaboratively selecting their own work during the Sprint."],"answers":[1,3,6],"desiredAnswers":null},{"id":"PO_11.20","text":"You are the Scrum Master of a new, to be developed product. Development is going to require 45 people. What is a good first question for you to suggest the group thinks about when forming into teams? ","options":["Who are going to be the team leads?","How will we make sure all teams have the right amount of expertise","Who are the subject matter experts on each team?","What is the right mixture of senior and junior people on each team?"],"answers":[1],"desiredAnswers":null},{"id":"PO_12.1","text":"Why does the Product Owner want the Development Team to adhere to its definition of \"Done?","options":["To have complete transparency into what has been done at the end of each Sprint.","To predict the team's productivity over time.","To know what the team will deliver over the next three Sprints.","To be able to reprimand the team when they don't meet their velocity goal for the Sprint."],"answers":[0],"desiredAnswers":null},{"id":"PO_12.2","text":"When should the Product Owner update the project plan?","options":["After the Daily Scrum to ensure an accurate daily overview of project progress.","Before the Sprint Planning to know how much work will have to be done in the Sprint.","The Product Owner shouldn't be occupied by that. It is work for the Project Manager.","The Product Backlog is the plan in Scrum. It is updated as new information and insights emerge."],"answers":[3],"desiredAnswers":null},{"id":"PO_12.3","text":"You are a product manager with a proven track record in your company. Your management has asked you to take the lead in the development of a new product. Six teams new to Scrum will build this product. What would you strive for? (choose the best two answers) ","options":["There should be six Product Owners, one for each Scrum Team.","Each Scrum Team should have a separate Product Backlog.","The product has one Product Backlog.","There should be six Product Owners, reporting to a chief Product Owner.","There should be only one Product Owner."],"answers":[2,4],"desiredAnswers":null},{"id":"PO_12.4","text":"Who determines when it is appropriate to update the Sprint Backlog during a Sprint?","options":["The Scrum Team.","The Project Manager.","The Product Owner.","The Development Team."],"answers":[3],"desiredAnswers":null},{"id":"PO_12.5","text":"You are the Scrum Master for four Scrum Teams working from the same Product Backlog. Several of the developers come to you complaining that work identified for the upcoming two Sprints will require full-time commitment from a technical specialist who is external to the teams. What are two key concerns for the Scrum Master to take into account in this situation? (choose the best two answers) ","options":["The benefit of Development Teams figuring out a solution for themselves.","The need to have enough work to keep all Development Team members busy.","The ability of the Development Teams to produce integrated Increments.","The desire to maintain a stable velocity."],"answers":[0,2],"desiredAnswers":null},{"id":"PO_12.6","text":"What are three benefits of having a Product Vision? (choose 3 answers)","options":["It helps identify when the complete Product Backlog should be finished.","It helps identify the best time for releasing the product.","It helps the team stay focused and make better decisions.","It gives an overall direction to the Sprints.","It makes it easier to inspect the incremental progress of the product.","It’s a traditional concept, and there are no benefits of it."],"answers":[2,3,4],"desiredAnswers":null},{"id":"PO_12.7","text":"What's the role of the Product Owner during Sprint Retrospective?","options":["Capture requirements for the Product Backlog","Participate as a Scrum Team member","To answer questions of the developers","Capture process improvement ideas for the next Sprint Backlog"],"answers":[1],"desiredAnswers":null},{"id":"PO_12.8","text":"Which two statements about the Sprint Goal are false? (choose 2 answers)","options":["It's a forecast that will be adjusted during the Sprint.","The Development Team commits to it.","The Development Team self-organizes to find ways to achieve this goal.","It helps increase focus.","It's created by the Product Owner to make the purpose of the Sprint clear"],"answers":[0,4],"desiredAnswers":null},{"id":"PO_12.9","text":"Velocity of Scrum Teams should be normalized, so that management can measure and compare their performance. ","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_12.10","text":"When is the Sprint over? (Choose two answers)","options":["When the Sprint Backlog tasks are done","When the Product Owner announces the end of the Sprint","When the timeboxed duration is over","When all Sprint Backlog items are done","When the Product Owner cancels the Sprint"],"answers":[2,4],"desiredAnswers":null},{"id":"PO_12.11","text":"When is it time to integrate the code?","options":["Before each release","Frequently, during the Sprint","At the end of each Sprint","At the end of the project"],"answers":[1],"desiredAnswers":null},{"id":"PO_12.12","text":"Scrum Master is a management role.","options":["TRUE"],"answers":[0],"desiredAnswers":null},{"id":"PO_12.13","text":"Team A and Team B are working on two projects in our company. Team A has 6 developers and a velocity of 300. Team B has 8 developers and a velocity of 400. Which team is more productive?","options":["Team A","The same","It depends","Team B"],"answers":[2],"desiredAnswers":null},{"id":"PO_12.14","text":"Which of the following is needed for starting a new Sprint Planning?","options":["Having the items at the top of the Product Backlog small enough to fit in one Sprint","None","Having the requirements specified and completely reflected in the Product Backlog","Having the Product Backlog items clearly described and assigned to developers"],"answers":[1],"desiredAnswers":null},{"id":"PO_12.15","text":"As the Development Team starts work during the Sprint, it realizes it has selected too much work to finish the Sprint. What should it do? (choose the best answer) ","options":["As soon as possible in the Sprint, work with the Product Owner to remove some work or Product Backlog Items.","Reduce the definition of \"Done\" and get all of the Product Backlog items \"Done\" by the new definition.","Inform the Product Owner at the Sprint Review, but prior to the demonstration.","Find another Scrum Team to give the excess work to."],"answers":[0],"desiredAnswers":null},{"id":"PO_12.16","text":"Who is responsible for engaging stakeholders?","options":["The Scrum Master","The Project Manager","The Development Team","The Product Owner"],"answers":[3],"desiredAnswers":null},{"id":"PO_12.17","text":"Which two of the following best describe Sprint Planning? (choose 2 answers) ","options":["Who will be in the team this Sprint?","What was the feedback and how should we adapt the Product Backlog?","Who will do what we have decided to do in the Sprint?","What are we going to do during the Sprint?","How are we going to do what we have decided to do in the Sprint?"],"answers":[3,4],"desiredAnswers":null},{"id":"PO_12.18","text":"During Sprint Planning, the team has some doubts about a few items at the top of the Product Backlog. Product Owner tries to contact the customer to talk to them about the meanings of the items, but all customer representatives are in a meeting and won't be out until two hours after the planned finish of Sprint Planning. What would you advise, as the Scrum Master?","options":["Cancel the Sprint Planning meeting, give them some time to prepare, and then hold another Sprint Planning.","Ask the developers to come up with their best guess and do not worry about the capacity.","Cancel the Sprint and start the next one when the items are clear.","Extend the duration of Sprint Planning and ask them to discuss the items more and get into agreement."],"answers":[1],"desiredAnswers":null},{"id":"PO_12.19","text":"Which two of the following actions may a Scrum Master take in starting up a project? (choose 2 answers)","options":["Ask the Development Team to discuss and identify the way they are going to develop the product.","Ask the Product Owner to explain the project, its business need, history, goals, and context.","Ask the development managers to introduce their departments and capabilities.","Ensure that there’s a clear understanding of the whole scope of the project.","Ensure that team members have clear roles and responsibilities."],"answers":[0,1],"desiredAnswers":null},{"id":"PO_12.20","text":"Which two of the following should be considered in setting the timeboxed duration of Sprints? (choose 2 answers)","options":["It should be longer in bigger projects.","It shouldn't be longer than 6 weeks.","It shouldn't be longer than one month.","It's better to have shorter Sprints when the project is riskier.","It should be shorter when there are more developers."],"answers":[2,3],"desiredAnswers":null},{"id":"PO_13.1","text":"Having the team members and a complete Product Backlog are the only things needed to start the project.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_13.2","text":"Which two of the following explain how Scrum promotes self-organization? (choose 2 answers)","options":["By not allowing titles in the Development Team","By allowing the Development Team to decide what to do during the Sprint","By not allowing documentation","By preventing stakeholders from contacting the developers during the Sprint"],"answers":[0,1],"desiredAnswers":null},{"id":"PO_13.3","text":"All contact between the developers and the stakeholders should be through the Product Owner.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_13.4","text":"Which statement explains a benefit of having tests in the Definition of Done?","options":["It makes it easier for the Scrum Master to measure performance and report progress.","It makes reporting easier for the Project Manager.","Increases transparency of the Increments."],"answers":[2],"desiredAnswers":null},{"id":"PO_13.7","text":"How much time should a Product Owner spend with the developers?","options":["As much as needed","At least 30%","100% of their time","About 10% of their time."],"answers":[0],"desiredAnswers":null},{"id":"PO_13.8","text":"One of the Scrum values is commitment. Which of the following statements best describes it?","options":["It's about dedication, and the intent and effort put into work.","It's about delivering all items in the Sprint Backlog.","It's about achieving the result that you have committed to."],"answers":[0],"desiredAnswers":null},{"id":"PO_13.11","text":"What is the role of management in Scrum?","options":["To facilitate the Scrum Teams with insights and resources that help them improve.","To identify and remove people that aren't working hard enough.","To monitor the Development Team's productivity.","To continually monitor staffing levels of the Development Team."],"answers":[0],"desiredAnswers":null},{"id":"PO_13.14","text":"A product's success is measured by: (choose the best three answers)","options":["The impact on my boss's mood.","The impact on customer satisfaction.","The impact on my performance rating.","The impact on cost.","The impact on revenue.","The delivery of upfront defined scope compared to the upfront planned time."],"answers":[1,3,4],"desiredAnswers":null},{"id":"PO_13.15","text":"What might indicate to a Product Owner that she needs to work more with the Scrum Team?","options":["The acceptance tests don't appear to be complete.","Developers leave the Team.","The increment presented at the Sprint Review does not reflect what she thought she had asked for.","She isn't working full time with the Scrum team."],"answers":[2],"desiredAnswers":null},{"id":"PO_13.16","text":"A Product Backlog is: (choose the best three answers)","options":["Managed by the Product Owner.","Ordered based on priority, value, dependencies, and risk.","Only visible to the Product Owner and stakeholders.","An inventory of things to be done for the Product.","An exhaustive list of upfront approved requirements to be implemented for the system."],"answers":[0,1,3],"desiredAnswers":null},{"id":"PO_13.17","text":"Scrum is based on empirical process control theory. All of its artifacts must be transparent to ensure sufficient accuracy of inspection. Select two ways to maintain the Product Backlog to maximize its transparency? (choose the best two answers)","options":["Product Backlog items are sized appropriately, i.e. not bigger than a Sprint and with a preference for several do-able items in a Sprint.","Product Backlog items should hold no more than 8 points of work, which is the average in the range of acceptable sizes of 1, 2, 3, 5, 8, and 13.","Product Backlog is only updated at a release planning meeting with the stakeholders and the release train engineers present.","The Product Backlog always has the most actual insights.","Product Backlog is only updated at the Sprint Review, when both the Scrum Team and the stakeholders are available."],"answers":[0,3],"desiredAnswers":null},{"id":"PO_13.18","text":"What is the role of the Product Owner in crafting the Sprint Goal?","options":["The Product Owner must work with the stakeholders to set each Sprint's Goal.","The Product Owner defines the scope for a Sprint and therefore also the Sprint Goal.","The Product Owner has no role in it. This is the Development Team's responsibility.","The Product Owner should come to the Sprint Planning with a business objective in mind and work with the Development Team to craft the Sprint Goal based upon the forecast.","The Product Owner shouldn't come to the Sprint Planning without a clearly defined Sprint Goal."],"answers":[3],"desiredAnswers":null},{"id":"PO_13.20","text":"At the seventh Sprint Review, the stakeholders are disappointed and angry. They have determined that the product or system being built both will not meet their needs and will cost more than they are willing to spend. What factors may have led to this? (choose the best three answers)","options":["Changes to the project plan were not adequately documented and shared.","The stakeholders were not allowed to enter the development area.","The stakeholders haven't been using the Sprint Reviews to inspect and evaluate progress.","The Project Management Office(PMO) has not been engaged adequately.","The Product Owner has not been keeping the stakeholders aware of the progress of the project.","The Scrum Master has not ensured that the project is transparent."],"answers":[2,4,5],"desiredAnswers":null},{"id":"PO_14.1","text":"Which of the following is a prerequisite for starting the Sprint Planning meeting?","options":["Having the Product Backlog items cleared and assigned to developers","None","Having the items at the top of the Product Backlog small enough to fit in one Sprint","Complete Product Backlog"],"answers":[1],"desiredAnswers":null},{"id":"PO_14.3","text":"How should the Product Owner forecast the completion date?","options":["By using a trend line in the burn-down chart","By dividing the remaining amount of work in the Product Backlog to the latest calculated velocity","This is the responsibility of the Scrum Master to forecast the completion date","By any method which the Product Owner finds appropriate"],"answers":[3],"desiredAnswers":null},{"id":"PO_14.4","text":"Which of the following is done in the first Sprint?","options":["Planning the project","Completing the reference architecture","Developing the product vision","Creating a shippable piece of functionality"],"answers":[3],"desiredAnswers":null},{"id":"PO_14.5","text":"Which of the following practices might help the Product Owner minimize waste in developing and sustaining the Product Backlog? (choose the best two answers)","options":["Let others manage the Product Backlog.","Only fully describe Product Backlog items when it seems sure that they are likely to be implemented.","Always write the Product Backlog items as computer code that will later just be tested by developers.","Write or cause Product Backlog items to be written clearly, and with as little ambiguity as possible."],"answers":[1,3],"desiredAnswers":null},{"id":"PO_14.6","text":"How should a Development Team deal with non-functional requirements?","options":["Assign them to the lead developers on the team.","Handle them during the Integration Sprint preceding the Release Sprint.","Make sure the release department understands these requirements, but it is not the Development Team's responsibility.","Ensure every Increment meets them."],"answers":[3],"desiredAnswers":null},{"id":"PO_14.7","text":"A \"Done\" Increment is valuable if: (choose the best two answers)","options":["It has all the features that the Product Owner wanted in that Sprint.","It reduces long-term operational costs.","It is likely to increase customer satisfaction.","It is delivered when the Product Owner expected it.","It meets the business analyst's specifications."],"answers":[1,2],"desiredAnswers":null},{"id":"PO_14.8","text":"A Development Team asks their Product Owner to re-order the Product Backlog. The team is waiting for an external supplier to deliver a specific software component. Without that component there won´t be enough work in the next Sprint to occupy the full team. The Product Owner asks the Scrum Master for help. What would be good advice to give the Product Owner? (choose the best answer)","options":["Tell the Product Owner that the Product Backlog should be ordered to maximize utilization of the Development Team.","Tell the Product Owner that his primary concern is the flow of value reflected in the ordering of the Product Backlog.","Tell the Product Owner to re-order the Product Backlog so the work involving the external component can be planned in a separate sprint."],"answers":[1],"desiredAnswers":null},{"id":"PO_14.9","text":"In order to achieve the benefits of Scrum, it is important to enact the value of commitment. What two actions demonstrate the commitment of Scrum Team members? (choose the best two answers)","options":["Help the other Scrum Team members.","Do your best.","Always deliver the items in the Sprint forecast.","Work late.","Send out a daily status report."],"answers":[0,1],"desiredAnswers":null},{"id":"PO_14.10","text":"Marian is the Product Owner envisioning a project for a new release of her product. She made a projection of a release date based upon a sustained velocity of 17 completed units of work per Sprint. Over the first 3 Sprints, the average velocity was 13 for work that the Development Team estimated as 90% done. The Development Teams, feeling the need to meet the plan, figured that a velocity of 17 was within their reach. A good way to continue is:","options":["The opportunity to inspect and adapt is lost. Opaqueness has replaced transparency. Predictability has dropped below zero. The produced software is not usable. As the rules of Scrum have not been respected, it is the Scrum Master's duty to assess whether repair is possible, or a restart with a more reliable team. If not, the Scrum Master should cancel the project.","The Development Team should remind Marian to find funding for enough Release Sprints in which the remaining work can be done.","The Development Team informs Marian that the progress she has perceived to date is not correct. The Increment is not releasable. They give Marian their estimate of the effort it would take to get the past work \"Done,\" and suggest doing that work first before proceeding with new features. In the end, it is Marian's call to continue the project or to cancel.","Add enough people to the Development Team for the deadline to be made.","Replace the Scrum Master with a project manager, who takes control of the project.","The Development Team makes sure that all of the selected scope per Sprint is as \"Done\" as possible. The undone work is estimated and added to the Sprint Backlog of the next Sprint, so it doesn't mess up the Product Backlog."],"answers":[2],"desiredAnswers":null},{"id":"PO_14.11","text":"Which two of the following may change during the Sprint? (choose 2 answers)","options":["Composition of the team","Sprint Backlog","Expected quality","Product Backlog"],"answers":[1],"desiredAnswers":null},{"id":"PO_14.12","text":"When multiple teams are working on the same product, their Sprints should start and end at the same time.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_14.14","text":"The Development Team realizes that they have over-committed themselves for the Sprint. Which two statements apply in this situation? (choose 2 answers)","options":["They should ask the Product Owner to cancel the Sprint.","They can make any adjustments by themselves, because they own the Sprint Backlog.","They shouldn't make any changes to the Sprint Backlog.","They can review and adjust the technical work of the items by themselves.","They can get help from the Product Owner to adjust the Sprint Backlog."],"answers":[3,4],"desiredAnswers":null},{"id":"PO_14.15","text":"Which two statements explain why the Definition of Done is important for the Product Owner? (choose 2 answers)","options":["It helps the Product Owner measure the progress of Sprints.","It helps the Product Owner identify undone work and create Product Backlog items for it.","The Product Owner will be confident that the Increment will be usable by the end users, if they decide to release it.","Assures that the Increment is potentially releasable."],"answers":[2,3],"desiredAnswers":null},{"id":"PO_14.16","text":"Which statement is correct about the Sprint Backlog?","options":["It has all the details.","It has just enough detail.","It has no detail."],"answers":[1],"desiredAnswers":null},{"id":"PO_14.18","text":"The Development Team is ready to start the first Sprint, but the Product Backlog is not ready yet. What should the Product Owner do?","options":["Let the team start the first Sprint, and continue refining the Product Backlog.","Ask the developers to help you refine the Product Backlog instead of starting the first Sprint.","Let the Sprint begin, but only with the goal of completing the Product Backlog."],"answers":[0],"desiredAnswers":null},{"id":"PO_14.19","text":"Which of the following is a valid service from the Scrum Master to the Product Owner?","options":["Act as a proxy when the Product Owner is not available to the team.","Help the Product Owner find techniques for managing the Product Backlog.","Act as the middleman between the Product Owner and the Development Team, as requested or required.","Help the Product Owner order the Product Backlog items in order to maximize value."],"answers":[1],"desiredAnswers":null},{"id":"PO_14.20","text":"Which two of the following activities are considered Product Backlog Refinement? (choose 2 answers)","options":["Breaking down Product Backlog items into tasks","Estimating the size of Product Backlog items","Selecting Product Backlog items for the Sprint Backlog","Adding detail to the Product Backlog"],"answers":[1,3],"desiredAnswers":null},{"id":"PO_15.1","text":"In order to make investment decisions, the Product Owner is likely to look at the Total Cost of Ownership (TCO) of the product being built. What costs will a Product Owner take into account?","options":["All Investments required to conceive, develop, operate and maintain the product","The money spent on develomentof the product, often a fixed cost per Sprint multiplied by the Sprints required","The accumulated cost over the earned value of the product"],"answers":[0],"desiredAnswers":null},{"id":"PO_15.2","text":"How important is it for a Product Owner to order Product Backlog Items by value points?","options":["Calculating value points is an upfront approach that conflicts with the empiricism of Scrum, and is therefore not acceptable.","Using value points is the ultimate way for a Product Owner to predict the value that the product will provide.","it is a good practice, keeping in mind that market reception is the best measure of value."],"answers":[2],"desiredAnswers":null},{"id":"PO_15.5","text":"True or False: The Scrum Team should choose at least one high priority process improvement, identified during the Sprint Retrospective, and place it in the Product Backlog.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"PO_15.6","text":"How should multiple Scrum Teams deliver a \"Done\", potentially shippable Increment in a Sprint? (choose the best answer)","options":["Each Sprint, all Scrum Teams have a \"Done\" increment that integrates with all of the other \"Done\" increments from all other Scrum Teams on the initiative. The sum of all increments is the increment for that product.","Each Scrum Team Provides a unique \"Done\" increment that includes the team's added functionality.","Functionality not intergrated with the work of other Scrum Teams may be delivered as unintegrated increments.","Each Scrum Team delivers \"Done\" increments of its own area of responsibility. These increments are integrated into a whole product during stabilization prior to release."],"answers":[0],"desiredAnswers":null},{"id":"PO_15.7","text":"A Nexus Daily Scrum: (choose the best two answers)","options":["is an opportunity to make integration issues transparent.","is only for the Nexus Integration Team to plan their work for the next 24 hours.","provides input into each team's individual Daily Scrums, so that each team can better plan their work until their next Daily Scrum.","is the same as a Scrum-of-Scrums.","provides a single meeting where all teams can update the Sprint Backlog."],"answers":[0,2],"desiredAnswers":null},{"id":"PO_15.12","text":"What typically happens if the Product Backlog is not sufficiently clear at Sprint Planning? (Choose the best answer)","options":["The Dev Team has difficulties creating a forecast of work for the Sprint","It is compensated if the Product Owner gives the team a clear Sprint Goal instead","The meeting is cancelled so refinement can bedone first","Nothing in particular","The Scrum Master shouldn't allow this to happen. Look for a new Scrum Master and restart the Sprint"],"answers":[0],"desiredAnswers":null},{"id":"PO_15.17","text":"Which two of the following are appropiate topics for discussion during a Sprint Retro?","options":["The order of items in the Product Backlog","How the team collaborates","Documenting acceptance criteria for items in the next Sprint","Identifying high priority process improvements for the next Sprint"],"answers":[1,3],"desiredAnswers":null},{"id":"PO_15.19","text":"If two Scrum Teams are added to the development of a product that previously had only one Scrum Team, what will be the immediate impact on the productivity of the original Scrum Team? (choose the best answer)","options":["Its productivity is likely to stay the same","Its productivity is likely to increase","Its productivity is likely to decrease"],"answers":[2],"desiredAnswers":null},{"id":"SPO_1","text":"A Product Owner is entitled to postpone the start of a new Sprint after the conclusion of a previous Sprint for the following reason:","options":["The QA department needs more time to make the previous Increment \"Done\".","Not enough Product Backlog items are \"Ready\".","There is no acceptable reason. A new Sprint starts immediately after the conclusion of the previous Sprint.","The stakeholders are not happy with the value produced in the previous Sprint.","The Product Owner has not identified a Sprint Goal."],"answers":[2],"desiredAnswers":null},{"id":"SSM_1","text":"Which three behaviors demonstrate that a team is NOT self-organizing and are NOT following the Scrum Guide?","options":["The Development Team creates their own sprint backlog, reflecting all work that is part of the definition of \"Done\".","Stakeholders attend the Daily Scrum to check progress and work with the Scrum Master to optimize the functional scope for the Sprint.","The Development Team members are working within the boundaries of their functional description and nicely handing off work from analyst to developer to tester to integration.","Development Team members collaboratively selecting their own work during the Sprint.","The Development Team has all the skills needed to create a releasable Increment.","The Development Team invites external people to the Sprint Planning to ask them how to turn a Product Backlog item into an Increment via a complete and detailed Sprint Backlog."],"answers":[1,2,5],"desiredAnswers":null},{"id":"SSM_2","text":"Which of the following services are appropriate for a Scrum Master in regard to the Daily Scrum?","options":["Teach the Development Team to keep the Daily Scrum within the 15 minute time-box.","All answers apply.","Facilitate in a way that ensures each team member has a chance to speak.","Ensure that all 3 questions have been answered.","Lead the discussions of the Development Team."],"answers":[0],"desiredAnswers":null},{"id":"SSM_3","text":"The time-box for a Daily Scrum is?","options":["4 hours.","15 minutes.","The same time of day every day.","Two minutes per person.","15 minutes for a 4 week sprint. For shorter Sprints it is usually shorter."],"answers":[1],"desiredAnswers":null},{"id":"SSM_4","text":"It is mandatory that the product increment be released to production at the end of each Sprint.","options":["TRUE","FALSE"],"answers":[1],"desiredAnswers":null},{"id":"SSM_5","text":"The three pillars of empirical process control are:","options":["Respect For People, Kaizen, Eliminating Waste","Planning, Inspection, Adaptation","Planning, Demonstration, Retrospective","Inspection, Transparency, Adaptation","Transparency, Eliminating Waste, Kaizen"],"answers":[3],"desiredAnswers":null},{"id":"SSM_6","text":"The Development Team should not be interrupted during the Sprint. The Sprint Goal should remain intact. These are conditions that foster creativity, quality and productivity. Based on this, which of the following is FALSE","options":["The Development Team may work with the Product Owner to remove or add work if it finds it has more or less capacity than it expected.","The Product Owner can help clarify or optimize the Sprint when asked by the Development Team.","As a decomposition of the selected Product Backlog Items, the Sprint Backlog changes and may grow as the work emerges.","The Sprint Backlog is fully formulated in the Sprint Planning meeting and does not change during the Sprint."],"answers":[3],"desiredAnswers":null},{"id":"SNX_1","text":"The Purpose of the Nexus Sprint Backlog is: (choose the best two answers)","options":["To provide a view of all Product backlog intems in a Sprint","To make the work of the Nexus Integration Team transparent.","To make dependencies transparent to the teams.","To visualize all Product Backlog items."],"answers":[0,2],"desiredAnswers":null},{"id":"SNX_2","text":"Technical systems can be decomposed to composite elements, from the large to the small. Basic components may be represented as activities, workflows, functions, features, capabilities, and other similar nomenclature. How does this system decomposition affect Scrum Teams on scaled projects?<br />\r\n","options":["Scrum Teams self-organize according to the system decomposition created in design models. The Product Backlog is similarly decomposed. People are assigned to Scrum Teams based on expertise. Hardening Sprints ensure time for resolving dependencies between teams.","There is one Scrum Team for each functional software layer whose job is to co-ordinate dependencies, work allocation, integration, and testing.","Meta-Scrum Teams of up to two hundred people are formed. They then map themselves into appropriately sized Scrum Teams for actual development. This may change every Sprint. Each Meta-Scrum Team manages its own decomposition and integration needs."],"answers":[],"desiredAnswers":null}]